#### `terraform plan` Success
<details><summary>Show Output</summary>

```
  = (known after apply)
      + max_session_duration  = 3600
      + name                  = "instance_role"
      + path                  = "/"
      + unique_id             = (known after apply)
    }

  # aws_iam_role_policy.flow_logs will be created
  + resource "aws_iam_role_policy" "flow_logs" {
      + id     = (known after apply)
      + name   = "flow_logs_role_policy"
      + policy = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "logs:PutLogEvents",
                          + "logs:DescribeLogStreams",
                          + "logs:DescribeLogGroups",
                          + "logs:CreateLogStream",
                          + "logs:CreateLogGroup",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                      + Sid      = "AllowAllLogActionsOnAllResources"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + role   = (known after apply)
    }

  # aws_iam_service_linked_role.instance will be created
  + resource "aws_iam_service_linked_role" "instance" {
      + arn              = (known after apply)
      + aws_service_name = "ec2.amazonaws.com"
      + create_date      = (known after apply)
      + id               = (known after apply)
      + name             = (known after apply)
      + path             = (known after apply)
      + unique_id        = (known after apply)
    }

  # aws_internet_gateway.hosp_dev_igw will be created
  + resource "aws_internet_gateway" "hosp_dev_igw" {
      + id       = (known after apply)
      + owner_id = (known after apply)
      + tags     = {
          + "Department" = "hospital"
          + "Name"       = "HospDevIGW"
          + "Stack"      = "hospital-dev-environment"
          + "Stage"      = "prod"
          + "Type"       = "Networking"
        }
      + vpc_id   = (known after apply)
    }

  # aws_placement_group.hospital_dev will be created
  + resource "aws_placement_group" "hospital_dev" {
      + id                 = (known after apply)
      + name               = "hospital_dev_placement_group"
      + placement_group_id = (known after apply)
      + strategy           = "cluster"
    }

  # aws_resourcegroups_group.hosp_dev_resources will be created
  + resource "aws_resourcegroups_group" "hosp_dev_resources" {
      + arn  = (known after apply)
      + id   = (known after apply)
      + name = "HospitalDevelopementEnvironments"

      + resource_query {
          + query = jsonencode(
                {
                  + ResourceTypeFilters = [
                      + "AWS::AllSupported",
                    ]
                  + TagFilters          = [
                      + {
                          + Key    = "Stack"
                          + Values = [
                              + "hospital-dev-environment",
                            ]
                        },
                    ]
                }
            )
          + type  = "TAG_FILTERS_1_0"
        }
    }

  # aws_route_table.hosp_dev_subnet_rt will be created
  + resource "aws_route_table" "hosp_dev_subnet_rt" {
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + route            = [
          + {
              + cidr_block                = "0.0.0.0/0"
              + egress_only_gateway_id    = ""
              + gateway_id                = (known after apply)
              + instance_id               = ""
              + ipv6_cidr_block           = ""
              + nat_gateway_id            = ""
              + network_interface_id      = ""
              + transit_gateway_id        = ""
              + vpc_peering_connection_id = ""
            },
        ]
      + tags             = {
          + "Department" = "hospital"
          + "Name"       = "HospDevRouteTable"
          + "Stack"      = "hospital-dev-environment"
          + "Stage"      = "prod"
          + "Type"       = "Networking"
        }
      + vpc_id           = (known after apply)
    }

  # aws_route_table_association.hosp_dev_public_subnet_association[0] will be created
  + resource "aws_route_table_association" "hosp_dev_public_subnet_association" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # aws_s3_bucket.hospital_dev_s3 will be created
  + resource "aws_s3_bucket" "hospital_dev_s3" {
      + acceleration_status         = (known after apply)
      + acl                         = "private"
      + arn                         = (known after apply)
      + bucket                      = "hospital_dev"
      + bucket_domain_name          = (known after apply)
      + bucket_regional_domain_name = (known after apply)
      + force_destroy               = false
      + hosted_zone_id              = (known after apply)
      + id                          = (known after apply)
      + region                      = "us-east-2"
      + request_payer               = (known after apply)
      + tags                        = {
          + "Department" = "hospital"
          + "Name"       = "HospitalDevS3"
          + "Stack"      = "hospital-dev-environment"
          + "Stage"      = "prod"
          + "Type"       = "Storage"
        }
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)

      + logging {
          + target_bucket = (known after apply)
          + target_prefix = "log/"
        }

      + server_side_encryption_configuration {
          + rule {
              + apply_server_side_encryption_by_default {
                  + sse_algorithm = "AES256"
                }
            }
        }

      + versioning {
          + enabled    = (known after apply)
          + mfa_delete = (known after apply)
        }
    }

  # aws_s3_bucket.hospital_log_bucket will be created
  + resource "aws_s3_bucket" "hospital_log_bucket" {
      + acceleration_status         = (known after apply)
      + acl                         = "log-delivery-write"
      + arn                         = (known after apply)
      + bucket                      = "hospital_log_bucket"
      + bucket_domain_name          = (known after apply)
      + bucket_regional_domain_name = (known after apply)
      + force_destroy               = false
      + hosted_zone_id              = (known after apply)
      + id                          = (known after apply)
      + region                      = (known after apply)
      + request_payer               = (known after apply)
      + tags                        = {
          + "Department" = "hospital"
          + "Name"       = "HospitalDevS3Logging"
          + "Stack"      = "hospital-dev-environment"
          + "Stage"      = "prod"
          + "Type"       = "Logging"
        }
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)

      + versioning {
          + enabled    = (known after apply)
          + mfa_delete = (known after apply)
        }
    }

  # aws_s3_bucket_policy.hospital_dev_s3_policy will be created
  + resource "aws_s3_bucket_policy" "hospital_dev_s3_policy" {
      + bucket = (known after apply)
      + id     = (known after apply)
      + policy = (known after apply)
    }

  # aws_security_group.hospital_dev_ec2_sg will be created
  + resource "aws_security_group" "hospital_dev_ec2_sg" {
      + arn                    = (known after apply)
      + description            = "Managed by Terraform"
      + egress                 = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = ""
              + from_port        = 0
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "-1"
              + security_groups  = []
              + self             = false
              + to_port          = 0
            },
        ]
      + id                     = (known after apply)
      + ingress                = [
          + {
              + cidr_blocks      = [
                  + "63.250.249.138/32",
                  + "209.10.196.132/32",
                ]
              + description      = ""
              + from_port        = 22
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 22
            },
          + {
              + cidr_blocks      = [
                  + "63.250.249.138/32",
                  + "209.10.196.132/32",
                ]
              + description      = ""
              + from_port        = 3389
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 3389
            },
          + {
              + cidr_blocks      = [
                  + "63.250.249.138/32",
                  + "209.10.196.132/32",
                ]
              + description      = ""
              + from_port        = 443
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 443
            },
          + {
              + cidr_blocks      = [
                  + "63.250.249.138/32",
                  + "209.10.196.132/32",
                ]
              + description      = ""
              + from_port        = 8080
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 8080
            },
          + {
              + cidr_blocks      = [
                  + "63.250.249.138/32",
                  + "209.10.196.132/32",
                ]
              + description      = ""
              + from_port        = 80
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 80
            },
        ]
      + name                   = "hospital_dev_ec2_sg"
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Department" = "hospital"
          + "Name"       = "HospDevInstanceSG"
          + "Stack"      = "hospital-dev-environment"
          + "Stage"      = "prod"
          + "Type"       = "Networking"
        }
      + vpc_id                 = (known after apply)
    }

  # aws_storagegateway_gateway.hospital_dev_s3 will be created
  + resource "aws_storagegateway_gateway" "hospital_dev_s3" {
      + activation_key     = (known after apply)
      + arn                = (known after apply)
      + gateway_id         = (known after apply)
      + gateway_ip_address = "10.0.1.2"
      + gateway_name       = "hospital_dev_s3_gw"
      + gateway_timezone   = "UTC"
      + gateway_type       = "FILE_S3"
      + id                 = (known after apply)
      + tags               = {
          + "Department" = "hospital"
          + "Name"       = "HospDevStorageGatewayGateway"
          + "Stack"      = "hospital-dev-environment"
          + "Stage"      = "prod"
          + "Type"       = "Logging"
        }

      + smb_active_directory_settings {}
    }

  # aws_storagegateway_smb_file_share.hospital_dev[0] will be created
  + resource "aws_storagegateway_smb_file_share" "hospital_dev" {
      + arn                     = (known after apply)
      + authentication          = "ActiveDirectory"
      + default_storage_class   = "S3_STANDARD"
      + fileshare_id            = (known after apply)
      + gateway_arn             = (known after apply)
      + guess_mime_type_enabled = true
      + id                      = (known after apply)
      + kms_encrypted           = false
      + location_arn            = (known after apply)
      + object_acl              = "private"
      + read_only               = false
      + requester_pays          = false
      + role_arn                = (known after apply)
      + tags                    = {
          + "Department" = "hospital"
          + "Name"       = "HospDevStorageGatewaySMBFileShare"
          + "Stack"      = "hospital-dev-environment"
          + "Stage"      = "prod"
          + "Type"       = "Logging"
        }
      + valid_user_list         = [
          + "jean.gay",
        ]
    }

  # aws_storagegateway_smb_file_share.hospital_dev[1] will be created
  + resource "aws_storagegateway_smb_file_share" "hospital_dev" {
      + arn                     = (known after apply)
      + authentication          = "ActiveDirectory"
      + default_storage_class   = "S3_STANDARD"
      + fileshare_id            = (known after apply)
      + gateway_arn             = (known after apply)
      + guess_mime_type_enabled = true
      + id                      = (known after apply)
      + kms_encrypted           = false
      + location_arn            = (known after apply)
      + object_acl              = "private"
      + read_only               = false
      + requester_pays          = false
      + role_arn                = (known after apply)
      + tags                    = {
          + "Department" = "hospital"
          + "Name"       = "HospDevStorageGatewaySMBFileShare"
          + "Stack"      = "hospital-dev-environment"
          + "Stage"      = "prod"
          + "Type"       = "Logging"
        }
      + valid_user_list         = [
          + "byron.weiss",
        ]
    }

  # aws_storagegateway_smb_file_share.hospital_dev[2] will be created
  + resource "aws_storagegateway_smb_file_share" "hospital_dev" {
      + arn                     = (known after apply)
      + authentication          = "ActiveDirectory"
      + default_storage_class   = "S3_STANDARD"
      + fileshare_id            = (known after apply)
      + gateway_arn             = (known after apply)
      + guess_mime_type_enabled = true
      + id                      = (known after apply)
      + kms_encrypted           = false
      + location_arn            = (known after apply)
      + object_acl              = "private"
      + read_only               = false
      + requester_pays          = false
      + role_arn                = (known after apply)
      + tags                    = {
          + "Department" = "hospital"
          + "Name"       = "HospDevStorageGatewaySMBFileShare"
          + "Stack"      = "hospital-dev-environment"
          + "Stage"      = "prod"
          + "Type"       = "Logging"
        }
      + valid_user_list         = [
          + "scott.polomik",
        ]
    }

  # aws_storagegateway_smb_file_share.hospital_dev[3] will be created
  + resource "aws_storagegateway_smb_file_share" "hospital_dev" {
      + arn                     = (known after apply)
      + authentication          = "ActiveDirectory"
      + default_storage_class   = "S3_STANDARD"
      + fileshare_id            = (known after apply)
      + gateway_arn             = (known after apply)
      + guess_mime_type_enabled = true
      + id                      = (known after apply)
      + kms_encrypted           = false
      + location_arn            = (known after apply)
      + object_acl              = "private"
      + read_only               = false
      + requester_pays          = false
      + role_arn                = (known after apply)
      + tags                    = {
          + "Department" = "hospital"
          + "Name"       = "HospDevStorageGatewaySMBFileShare"
          + "Stack"      = "hospital-dev-environment"
          + "Stage"      = "prod"
          + "Type"       = "Logging"
        }
      + valid_user_list         = [
          + "david.gelerinter",
        ]
    }

  # aws_storagegateway_smb_file_share.hospital_dev[4] will be created
  + resource "aws_storagegateway_smb_file_share" "hospital_dev" {
      + arn                     = (known after apply)
      + authentication          = "ActiveDirectory"
      + default_storage_class   = "S3_STANDARD"
      + fileshare_id            = (known after apply)
      + gateway_arn             = (known after apply)
      + guess_mime_type_enabled = true
      + id                      = (known after apply)
      + kms_encrypted           = false
      + location_arn            = (known after apply)
      + object_acl              = "private"
      + read_only               = false
      + requester_pays          = false
      + role_arn                = (known after apply)
      + tags                    = {
          + "Department" = "hospital"
          + "Name"       = "HospDevStorageGatewaySMBFileShare"
          + "Stack"      = "hospital-dev-environment"
          + "Stage"      = "prod"
          + "Type"       = "Logging"
        }
      + valid_user_list         = [
          + "andrew.kulpa",
        ]
    }

  # aws_subnet.hospital_dev_subnet[0] will be created
  + resource "aws_subnet" "hospital_dev_subnet" {
      + arn                             = (known after apply)
      + assign_ipv6_address_on_creation = false
      + availability_zone               = "us-east-2a"
      + availability_zone_id            = (known after apply)
      + cidr_block                      = "10.0.1.0/24"
      + id                              = (known after apply)
      + ipv6_cidr_block                 = (known after apply)
      + ipv6_cidr_block_association_id  = (known after apply)
      + map_public_ip_on_launch         = true
      + owner_id                        = (known after apply)
      + tags                            = {
          + "Department" = "hospital"
          + "Name"       = "HospDevPublicSubnet"
          + "Stack"      = "hospital-dev-environment"
          + "Stage"      = "prod"
          + "Type"       = "Networking"
        }
      + vpc_id                          = (known after apply)
    }

  # aws_vpc.hosp_dev_vpc will be created
  + resource "aws_vpc" "hosp_dev_vpc" {
      + arn                              = (known after apply)
      + assign_generated_ipv6_cidr_block = false
      + cidr_block                       = "10.0.0.0/16"
      + default_network_acl_id           = (known after apply)
      + default_route_table_id           = (known after apply)
      + default_security_group_id        = (known after apply)
      + dhcp_options_id                  = (known after apply)
      + enable_classiclink               = (known after apply)
      + enable_classiclink_dns_support   = (known after apply)
      + enable_dns_hostnames             = true
      + enable_dns_support               = true
      + id                               = (known after apply)
      + instance_tenancy                 = "default"
      + ipv6_association_id              = (known after apply)
      + ipv6_cidr_block                  = (known after apply)
      + main_route_table_id              = (known after apply)
      + owner_id                         = (known after apply)
      + tags                             = {
          + "Name" = "HospDevVPC"
          + "Type" = "Networking"
        }
    }

  # aws_vpc_endpoint.s3 will be created
  + resource "aws_vpc_endpoint" "s3" {
      + cidr_blocks           = (known after apply)
      + dns_entry             = (known after apply)
      + id                    = (known after apply)
      + network_interface_ids = (known after apply)
      + owner_id              = (known after apply)
      + policy                = (known after apply)
      + prefix_list_id        = (known after apply)
      + private_dns_enabled   = false
      + requester_managed     = (known after apply)
      + route_table_ids       = (known after apply)
      + security_group_ids    = (known after apply)
      + service_name          = "com.amazonaws.us-east-2.s3"
      + state                 = (known after apply)
      + subnet_ids            = (known after apply)
      + vpc_endpoint_type     = "Gateway"
      + vpc_id                = (known after apply)
    }

  # module.asg.aws_autoscaling_group.this[0] will be created
  + resource "aws_autoscaling_group" "this" {
      + arn                       = (known after apply)
      + availability_zones        = (known after apply)
      + default_cooldown          = 300
      + desired_capacity          = 1
      + enabled_metrics           = [
          + "GroupDesiredCapacity",
          + "GroupInServiceInstances",
          + "GroupMaxSize",
          + "GroupMinSize",
          + "GroupPendingInstances",
          + "GroupStandbyInstances",
          + "GroupTerminatingInstances",
          + "GroupTotalInstances",
        ]
      + force_delete              = false
      + health_check_grace_period = 300
      + health_check_type         = "EC2"
      + id                        = (known after apply)
      + load_balancers            = (known after apply)
      + max_size                  = 5
      + metrics_granularity       = "1Minute"
      + min_elb_capacity          = 0
      + min_size                  = 0
      + name                      = (known after apply)
      + name_prefix               = (known after apply)
      + placement_group           = (known after apply)
      + protect_from_scale_in     = false
      + service_linked_role_arn   = (known after apply)
      + tags                      = [
          + {
              + "key"                 = "Name"
              + "propagate_at_launch" = "true"
              + "value"               = "HospitalDevASG"
            },
          + {
              + "key"                 = "Department"
              + "propagate_at_launch" = "true"
              + "value"               = "hospital"
            },
          + {
              + "key"                 = "Name"
              + "propagate_at_launch" = "true"
              + "value"               = "HospitalDevASG"
            },
          + {
              + "key"                 = "Stack"
              + "propagate_at_launch" = "true"
              + "value"               = "hospital-dev-environment"
            },
          + {
              + "key"                 = "Stage"
              + "propagate_at_launch" = "true"
              + "value"               = "prod"
            },
          + {
              + "key"                 = "Type"
              + "propagate_at_launch" = "true"
              + "value"               = "Compute"
            },
          + {
              + "key"                 = "WeekdayScheduled"
              + "propagate_at_launch" = "true"
              + "value"               = "true"
            },
        ]
      + target_group_arns         = (known after apply)
      + termination_policies      = [
          + "Default",
        ]
      + vpc_zone_identifier       = (known after apply)
      + wait_for_capacity_timeout = "0"

      + launch_template {
          + id      = (known after apply)
          + name    = (known after apply)
          + version = "$Latest"
        }
    }

  # module.asg.aws_launch_template.this[0] will be created
  + resource "aws_launch_template" "this" {
      + arn             = (known after apply)
      + default_version = (known after apply)
      + ebs_optimized   = "false"
      + id              = (known after apply)
      + image_id        = "ami-0aa302b3e12260e43"
      + instance_type   = "t3.medium"
      + latest_version  = (known after apply)
      + name            = (known after apply)
      + name_prefix     = "HospitalDevLaunchTemplate-"
      + user_data       = "IA=="

      + block_device_mappings {
          + device_name = "/dev/xvdz"

          + ebs {
              + encrypted   = "true"
              + iops        = (known after apply)
              + volume_size = 250
              + volume_type = "gp2"
            }
        }

      + iam_instance_profile {
          + arn = (known after apply)
        }

      + instance_market_options {
          + market_type = "spot"

          + spot_options {
              + max_price   = "0.03"
              + valid_until = (known after apply)
            }
        }

      + monitoring {
          + enabled = true
        }

      + network_interfaces {
          + associate_public_ip_address = "false"
          + delete_on_termination       = true
          + description                 = "HospitalDevLaunchTemplate"
          + device_index                = 0
          + security_groups             = (known after apply)
        }

      + placement {
          + tenancy = "default"
        }
    }

  # module.asg.null_resource.tags_as_list_of_maps[0] will be created
  + resource "null_resource" "tags_as_list_of_maps" {
      + id       = (known after apply)
      + triggers = {
          + "key"                 = "Department"
          + "propagate_at_launch" = "true"
          + "value"               = "hospital"
        }
    }

  # module.asg.null_resource.tags_as_list_of_maps[1] will be created
  + resource "null_resource" "tags_as_list_of_maps" {
      + id       = (known after apply)
      + triggers = {
          + "key"                 = "Name"
          + "propagate_at_launch" = "true"
          + "value"               = "HospitalDevASG"
        }
    }

  # module.asg.null_resource.tags_as_list_of_maps[2] will be created
  + resource "null_resource" "tags_as_list_of_maps" {
      + id       = (known after apply)
      + triggers = {
          + "key"                 = "Stack"
          + "propagate_at_launch" = "true"
          + "value"               = "hospital-dev-environment"
        }
    }

  # module.asg.null_resource.tags_as_list_of_maps[3] will be created
  + resource "null_resource" "tags_as_list_of_maps" {
      + id       = (known after apply)
      + triggers = {
          + "key"                 = "Stage"
          + "propagate_at_launch" = "true"
          + "value"               = "prod"
        }
    }

  # module.asg.null_resource.tags_as_list_of_maps[4] will be created
  + resource "null_resource" "tags_as_list_of_maps" {
      + id       = (known after apply)
      + triggers = {
          + "key"                 = "Type"
          + "propagate_at_launch" = "true"
          + "value"               = "Compute"
        }
    }

  # module.asg.null_resource.tags_as_list_of_maps[5] will be created
  + resource "null_resource" "tags_as_list_of_maps" {
      + id       = (known after apply)
      + triggers = {
          + "key"                 = "WeekdayScheduled"
          + "propagate_at_launch" = "true"
          + "value"               = "true"
        }
    }

  # module.asg.random_pet.asg_name[0] will be created
  + resource "random_pet" "asg_name" {
      + id        = (known after apply)
      + keepers   = (known after apply)
      + length    = 2
      + separator = "-"
    }

  # module.autoscaling-start-early-weekdays.aws_cloudwatch_event_rule.this will be created
  + resource "aws_cloudwatch_event_rule" "this" {
      + arn                 = (known after apply)
      + description         = "Trigger lambda scheduler"
      + id                  = (known after apply)
      + is_enabled          = true
      + name                = "trigger-lambda-scheduler-start-autoscaling-early-weekdays"
      + schedule_expression = "cron(0 13 * * 1-5)"
    }

  # module.autoscaling-start-early-weekdays.aws_cloudwatch_event_target.this will be created
  + resource "aws_cloudwatch_event_target" "this" {
      + arn       = (known after apply)
      + id        = (known after apply)
      + rule      = "trigger-lambda-scheduler-start-autoscaling-early-weekdays"
      + target_id = (known after apply)
    }

  # module.autoscaling-start-early-weekdays.aws_cloudwatch_log_group.this will be created
  + resource "aws_cloudwatch_log_group" "this" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + name              = "/aws/lambda/start-autoscaling-early-weekdays"
      + retention_in_days = 14
    }

  # module.autoscaling-start-early-weekdays.aws_iam_role.this[0] will be created
  + resource "aws_iam_role" "this" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "lambda.amazonaws.com"
                        }
                      + Sid       = ""
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + description           = "Allows Lambda functions to stop and start ec2 and rds resources"
      + force_detach_policies = false
      + id                    = (known after apply)
      + max_session_duration  = 3600
      + name                  = "start-autoscaling-early-weekdays-scheduler-lambda"
      + path                  = "/"
      + unique_id             = (known after apply)
    }

  # module.autoscaling-start-early-weekdays.aws_iam_role_policy.lambda_logging[0] will be created
  + resource "aws_iam_role_policy" "lambda_logging" {
      + id     = (known after apply)
      + name   = "start-autoscaling-early-weekdays-lambda-logging"
      + policy = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "logs:CreateLogStream",
                          + "logs:PutLogEvents",
                        ]
                      + Effect   = "Allow"
                      + Resource = "arn:aws:logs:*:*:*"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + role   = (known after apply)
    }

  # module.autoscaling-start-early-weekdays.aws_iam_role_policy.schedule_autoscaling[0] will be created
  + resource "aws_iam_role_policy" "schedule_autoscaling" {
      + id     = (known after apply)
      + name   = "start-autoscaling-early-weekdays-autoscaling-custom-policy-scheduler"
      + policy = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "autoscaling:DescribeScalingProcessTypes",
                          + "autoscaling:DescribeAutoScalingGroups",
                          + "autoscaling:DescribeTags",
                          + "autoscaling:SuspendProcesses",
                          + "autoscaling:ResumeProcesses",
                          + "autoscaling:UpdateAutoScalingGroup",
                          + "autoscaling:DescribeAutoScalingInstances",
                          + "autoscaling:TerminateInstanceInAutoScalingGroup",
                          + "ec2:TerminateInstances",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + role   = (known after apply)
    }

  # module.autoscaling-start-early-weekdays.aws_iam_role_policy.schedule_ec2[0] will be created
  + resource "aws_iam_role_policy" "schedule_ec2" {
      + id     = (known after apply)
      + name   = "start-autoscaling-early-weekdays-ec2-custom-policy-scheduler"
      + policy = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "ec2:DescribeInstances",
                          + "ec2:DescribeInstanceStatus",
                          + "ec2:StopInstances",
                          + "ec2:StartInstances",
                          + "ec2:DescribeTags",
                          + "ec2:TerminateSpotInstances",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + role   = (known after apply)
    }

  # module.autoscaling-start-early-weekdays.aws_iam_role_policy.schedule_rds[0] will be created
  + resource "aws_iam_role_policy" "schedule_rds" {
      + id     = (known after apply)
      + name   = "start-autoscaling-early-weekdays-rds-custom-policy-scheduler"
      + policy = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "rds:ListTagsForResource",
                          + "rds:DescribeDBClusters",
                          + "rds:StartDBCluster",
                          + "rds:StopDBCluster",
                          + "rds:DescribeDBInstances",
                          + "rds:StartDBInstance",
                          + "rds:StopDBInstance",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + role   = (known after apply)
    }

  # module.autoscaling-start-early-weekdays.aws_iam_role_policy.schedule_spot[0] will be created
  + resource "aws_iam_role_policy" "schedule_spot" {
      + id     = (known after apply)
      + name   = "start-autoscaling-early-weekdays-spot-custom-policy-scheduler"
      + policy = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "ec2:TerminateSpotInstances",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + role   = (known after apply)
    }

  # module.autoscaling-start-early-weekdays.aws_lambda_function.this will be created
  + resource "aws_lambda_function" "this" {
      + arn                            = (known after apply)
      + filename                       = ".terraform/modules/autoscaling-start-early-weekdays/diodonfrost-terraform-aws-lambda-scheduler-stop-start-76d9dd6/aws-stop-start-resources.zip"
      + function_name                  = "start-autoscaling-early-weekdays"
      + handler                        = "scheduler.main.lambda_handler"
      + id                             = (known after apply)
      + invoke_arn                     = (known after apply)
      + last_modified                  = (known after apply)
      + memory_size                    = 128
      + publish                        = false
      + qualified_arn                  = (known after apply)
      + reserved_concurrent_executions = -1
      + role                           = (known after apply)
      + runtime                        = "python3.7"
      + source_code_hash               = "sHMxfj3XO5Wtci5AOFVxZ6cxjwKEtiPcNpxwSSneojA="
      + source_code_size               = (known after apply)
      + timeout                        = 600
      + version                        = (known after apply)

      + environment {
          + variables = {
              + "AUTOSCALING_SCHEDULE" = "true"
              + "AWS_REGIONS"          = "us-east-2"
              + "EC2_SCHEDULE"         = "false"
              + "RDS_SCHEDULE"         = "false"
              + "SCHEDULE_ACTION"      = "start"
              + "SPOT_SCHEDULE"        = "false"
              + "TAG_KEY"              = "WeekdayScheduled"
              + "TAG_VALUE"            = "true"
            }
        }

      + tracing_config {
          + mode = (known after apply)
        }
    }

  # module.autoscaling-start-early-weekdays.aws_lambda_permission.this will be created
  + resource "aws_lambda_permission" "this" {
      + action        = "lambda:InvokeFunction"
      + function_name = "start-autoscaling-early-weekdays"
      + id            = (known after apply)
      + principal     = "events.amazonaws.com"
      + source_arn    = (known after apply)
      + statement_id  = "AllowExecutionFromCloudWatch"
    }

  # module.autoscaling-stop-late-weekdays.aws_cloudwatch_event_rule.this will be created
  + resource "aws_cloudwatch_event_rule" "this" {
      + arn                 = (known after apply)
      + description         = "Trigger lambda scheduler"
      + id                  = (known after apply)
      + is_enabled          = true
      + name                = "trigger-lambda-scheduler-stop-autoscaling-late-weekdays"
      + schedule_expression = "cron(0 1 * * 2-6)"
    }

  # module.autoscaling-stop-late-weekdays.aws_cloudwatch_event_target.this will be created
  + resource "aws_cloudwatch_event_target" "this" {
      + arn       = (known after apply)
      + id        = (known after apply)
      + rule      = "trigger-lambda-scheduler-stop-autoscaling-late-weekdays"
      + target_id = (known after apply)
    }

  # module.autoscaling-stop-late-weekdays.aws_cloudwatch_log_group.this will be created
  + resource "aws_cloudwatch_log_group" "this" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + name              = "/aws/lambda/stop-autoscaling-late-weekdays"
      + retention_in_days = 14
    }

  # module.autoscaling-stop-late-weekdays.aws_iam_role.this[0] will be created
  + resource "aws_iam_role" "this" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "lambda.amazonaws.com"
                        }
                      + Sid       = ""
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + description           = "Allows Lambda functions to stop and start ec2 and rds resources"
      + force_detach_policies = false
      + id                    = (known after apply)
      + max_session_duration  = 3600
      + name                  = "stop-autoscaling-late-weekdays-scheduler-lambda"
      + path                  = "/"
      + unique_id             = (known after apply)
    }

  # module.autoscaling-stop-late-weekdays.aws_iam_role_policy.lambda_logging[0] will be created
  + resource "aws_iam_role_policy" "lambda_logging" {
      + id     = (known after apply)
      + name   = "stop-autoscaling-late-weekdays-lambda-logging"
      + policy = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "logs:CreateLogStream",
                          + "logs:PutLogEvents",
                        ]
                      + Effect   = "Allow"
                      + Resource = "arn:aws:logs:*:*:*"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + role   = (known after apply)
    }

  # module.autoscaling-stop-late-weekdays.aws_iam_role_policy.schedule_autoscaling[0] will be created
  + resource "aws_iam_role_policy" "schedule_autoscaling" {
      + id     = (known after apply)
      + name   = "stop-autoscaling-late-weekdays-autoscaling-custom-policy-scheduler"
      + policy = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "autoscaling:DescribeScalingProcessTypes",
                          + "autoscaling:DescribeAutoScalingGroups",
                          + "autoscaling:DescribeTags",
                          + "autoscaling:SuspendProcesses",
                          + "autoscaling:ResumeProcesses",
                          + "autoscaling:UpdateAutoScalingGroup",
                          + "autoscaling:DescribeAutoScalingInstances",
                          + "autoscaling:TerminateInstanceInAutoScalingGroup",
                          + "ec2:TerminateInstances",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + role   = (known after apply)
    }

  # module.autoscaling-stop-late-weekdays.aws_iam_role_policy.schedule_ec2[0] will be created
  + resource "aws_iam_role_policy" "schedule_ec2" {
      + id     = (known after apply)
      + name   = "stop-autoscaling-late-weekdays-ec2-custom-policy-scheduler"
      + policy = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "ec2:DescribeInstances",
                          + "ec2:DescribeInstanceStatus",
                          + "ec2:StopInstances",
                          + "ec2:StartInstances",
                          + "ec2:DescribeTags",
                          + "ec2:TerminateSpotInstances",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + role   = (known after apply)
    }

  # module.autoscaling-stop-late-weekdays.aws_iam_role_policy.schedule_rds[0] will be created
  + resource "aws_iam_role_policy" "schedule_rds" {
      + id     = (known after apply)
      + name   = "stop-autoscaling-late-weekdays-rds-custom-policy-scheduler"
      + policy = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "rds:ListTagsForResource",
                          + "rds:DescribeDBClusters",
                          + "rds:StartDBCluster",
                          + "rds:StopDBCluster",
                          + "rds:DescribeDBInstances",
                          + "rds:StartDBInstance",
                          + "rds:StopDBInstance",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + role   = (known after apply)
    }

  # module.autoscaling-stop-late-weekdays.aws_iam_role_policy.schedule_spot[0] will be created
  + resource "aws_iam_role_policy" "schedule_spot" {
      + id     = (known after apply)
      + name   = "stop-autoscaling-late-weekdays-spot-custom-policy-scheduler"
      + policy = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "ec2:TerminateSpotInstances",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + role   = (known after apply)
    }

  # module.autoscaling-stop-late-weekdays.aws_lambda_function.this will be created
  + resource "aws_lambda_function" "this" {
      + arn                            = (known after apply)
      + filename                       = ".terraform/modules/autoscaling-stop-late-weekdays/diodonfrost-terraform-aws-lambda-scheduler-stop-start-76d9dd6/aws-stop-start-resources.zip"
      + function_name                  = "stop-autoscaling-late-weekdays"
      + handler                        = "scheduler.main.lambda_handler"
      + id                             = (known after apply)
      + invoke_arn                     = (known after apply)
      + last_modified                  = (known after apply)
      + memory_size                    = 128
      + publish                        = false
      + qualified_arn                  = (known after apply)
      + reserved_concurrent_executions = -1
      + role                           = (known after apply)
      + runtime                        = "python3.7"
      + source_code_hash               = "sHMxfj3XO5Wtci5AOFVxZ6cxjwKEtiPcNpxwSSneojA="
      + source_code_size               = (known after apply)
      + timeout                        = 600
      + version                        = (known after apply)

      + environment {
          + variables = {
              + "AUTOSCALING_SCHEDULE" = "true"
              + "AWS_REGIONS"          = "us-east-2"
              + "EC2_SCHEDULE"         = "false"
              + "RDS_SCHEDULE"         = "false"
              + "SCHEDULE_ACTION"      = "stop"
              + "SPOT_SCHEDULE"        = "false"
              + "TAG_KEY"              = "WeekdayScheduled"
              + "TAG_VALUE"            = "true"
            }
        }

      + tracing_config {
          + mode = (known after apply)
        }
    }

  # module.autoscaling-stop-late-weekdays.aws_lambda_permission.this will be created
  + resource "aws_lambda_permission" "this" {
      + action        = "lambda:InvokeFunction"
      + function_name = "stop-autoscaling-late-weekdays"
      + id            = (known after apply)
      + principal     = "events.amazonaws.com"
      + source_arn    = (known after apply)
      + statement_id  = "AllowExecutionFromCloudWatch"
    }

Plan: 67 to add, 0 to change, 0 to destroy.
```

</details>

*Workflow: `Terraform Pull Request Workflow`, Action: `hashicorpterraform-github-actions4`, Working Directory: `.`*
